tap "felixkratz/formulae"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "j178/tap"
tap "joshmedeski/sesh"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "bat"
brew "bob"
brew "cmatrix"
brew "dog"
brew "duf"
brew "entr"
brew "eza"
brew "fastfetch"
brew "fd"
brew "figlet"
brew "fzf"
brew "git"
brew "glow"
brew "htop"
brew "jq"
brew "lolcat"
brew "macchina"
brew "mactop"
brew "mole"
brew "mosh"
brew "neovim"
brew "nmap"
brew "nushell"
brew "parallel"
brew "pfetch"
brew "procs"
brew "ripgrep"
brew "rsync"
brew "sd"
brew "sk"
brew "starship"
brew "tmux"
brew "wget"
brew "witr"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "felixkratz/formulae/borders"
cask "nikitabobko/tap/aerospace"
cask "alacritty"
cask "db-browser-for-sqlite"
cask "espanso"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "numi"
cask "wezterm"
mas "AdBlock Pro", id: 1018301773
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Compressor", id: 424390742
mas "DaisyDisk", id: 411643860
mas "Final Cut Pro", id: 424389933
mas "Hour", id: 569089415
mas "Network Radar", id: 507659816
mas "The Unarchiver", id: 425424353
